Repository: eugeneai/books
Catalog: intech-mda/ru-en/omegat/project_save.tmx
Source language: ru_ru
Languages: en_gb

source: Одно и то же описание трансформации может использоваться во многих проектах.
en_gb: The same description of the transformation could be used in many projects.

source: Одной из актуальных задач для эффективного развития территорий является забота о здоровье населения.
en_gb: One of the urgent tasks for the effective development of the regions is taking care of the health of the population.

source: Он достаточно понятен разработчику и в то же время строг, что предоставляет возможность обработки ограничения с помощью соответствующего программного обеспечения.
en_gb: (SKIP)

source: Они представляют собой условие, которое должно быть выполнено для возможности осуществления перехода между смежными состояниями.
en_gb: (SKIP)

source: Особенности спецификации MDA состоят в том, что в ней представлены виды моделей, которые требуется модифицировать с целью получения исходного программного кода.
en_gb: MDA is based on a set of models to be modified in oreder to obtain the source code.

source: Охранные условия записываются в квадратных скобках и используются в качестве триггеров;
en_gb: guarging conditions are written in brackets and interpreted as triggers;

source: Платформенно"=независимая модель PIM~-- это основа MDA.
en_gb: PIM is the basis of MDA.

source: Платформенно"=независимая модель PIM~-- это основа MDA.~При помощи PIM ИС описывается на абстрактном уровне, который позволяет рассматривать разрабатываемую ИС как не зависящую от конкретных свойств программно"=аппаратной платформы будущей реализации.
en_gb: PIM is the basis of MDA. Using PIM IS is described on an abstract level, which allows us to consider the IS under development as independent of the specific properties of software and hardware platform, where it is to be implementaed.

source: По мере перебора элементов объектной модели, в соответствии с требованиями к ИС сценарий запускает для их трансформации интерпретатор Prolog.
en_gb: The first Iteration over the object model produces set of initial facts on the PIM structure in Prolog environmant.

source: Под адаптацией кода в рамках рассматриваемой реализации понимается связывание порожденных элементов ИС.
en_gb: (?) It embodies the binding generated elements of IS.

source: Поддержка целостности при модификации.
en_gb: Support integrity chek in modification processing.

source: Порождение кода ведется с исполнением сценариев синтеза, осуществляющих запросы к базе знаний, содержащей правила трансформации моделей.
en_gb: (SHT)The generation of the code is carried on by execution of sythesizing scripts, which query the knowledge base containing the rules of the model transformation.

source: Порождение по одной модели гарантирует совместимость интерфейсов для информационного обмена, для случая распределенной среды функционирования.
en_gb: In the case of distributed environments, the common model ensures the compatibility of the interfaces for information exchange in the environment.

source: После генерации программного кода ИС требуется его адаптация.
en_gb: After generating the program code of the IS its adaptation required.

source: После того как PIM достаточно детализирована, выполняется переход к модели, зависяшей от платформы (Platform Specific Model, PSM) \cite{b115}.
en_gb: After PIM are sufficiently detailed, the Platform specific model (PSM) is constructed \cite{b115}.

source: Поэтому необходимо, чтобы язык описания трансформации позволял задавать трансформации, применимые для множества проектов, а не только для одной конкретной UML"=модели.
en_gb: Therefore, the language of the description of the transformation must allow specification of transformations that apply to many projects, not just for one specific UML model.

source: Предусловиями называются ограничения, которым должны удовлетворять входные значения функции, а постусловиями~-- ограничения, которым удовлетворяют выходные значения функции.
en_gb: (SKIP)

source: Прежде всего у разработчика отсутствует возможность добавлять новые описания трансформаций или изменять существующие; он вынужден использовать то, что сделано разработчиками инструмента.
en_gb: (SHT)The developer has less options to add new transformations or change existing ones,and is forced to use the existing tools.

source: Преобразование из PIM в PSM осуществляется при помоши формального представления свойств платформы, модели программно"=аппаратной платформы (Platform Model).
en_gb: The transformation from PIM to PSM is carried out according to a formal representation of the properties of the target platform, i.e., Platform Model (PM).

source: При первом обрашении пациента в онкологический кабинет или диспансер на него заводится документ «Извещение о впервые установленном злокачественном новообразовании».
en_gb: The first coming of the patient to an oncology office or clinic result in the document "Notice of first established malignant neoplasm" is being created.

source: При помощи PIM ИС описывается на абстрактном уровне, который позволяет рассматривать разрабатываемую ИС как не зависящую от конкретных свойств программно"=аппаратной платформы будущей реализации.
en_gb: Using PIM IS is described on an abstract level, which allows us to consider the IS under development as independent of the specific properties of software and hardware platform, where it is to be implementaed.

source: При разработке 13М1 -диаграмма является как средством формального описания системы, так и средством ее документирования для разработчика.
en_gb: and in a development process UML diagrams are the language for formal description of the system, as well as means of documenting.

source: При этом в среду разработки на этапе ее создания встраивается набор модулей трансформаций, которые позднее могут быть задействованы разработчиком для генерирования программного кода.
en_gb: (SHT) In the development environment at the stage of its creation, the set of transformation modules is embedded, which can later be used by the developer to generate source code.

source: При этом должен иметься способ поддерживать соответствие между этими моделями, достигнутое в процессе трансформации.
en_gb: Thus there must be a way to maintain correspondence between these models after the transformation process.

source: При этом некоторые аспекты реализуемых подсистем можно описать при помощи дополнительных, пользовательских тэгов для объектов UML"=диаграммы.
en_gb: A very specific implementation aspects of subsystems are described with custom UML tags values and stereotypes.

source: При этом описание должно быть формализованным настолько, чтобы было возможно автоматическое его выполнение.
en_gb: The description should be formalized so that it can be used in automatic execution.

source: При этом скорее всего потребуются его изменение и настройка под специфические требования.
en_gb: In this case, change and adaptation of the description will be required to specific conditions.

source: Применение OCL в UML"=диаграммах обусловлено необходимостью задания детальной формальной спецификации объектов.
en_gb: (SKIP)

source: Применение Webтехнологий позволяет избегать необходимости установки специализированного программного обеспечения на каждую рабочую станцию, а кроссплатформенность снижает зависимость от политики поставщиков программного обеспечения и обеспечивает достаточно высокий уровень масштабируемости.
en_gb: (REV, SKIP) Web applications allows developers ids the need to install specialized software on each workstation, and the platform reduces the dependence from the policies of software vendors and provides a fairly high level of scalability.

source: Применение технологии синтеза каркаса информационной системы по ее формальной модели показало ее высокую эффективность при создании медицинской информационной системы «Популяционный раковый регистр».
en_gb: Application of technology of synthesis of a skeleton of the information system according to its formal model has shown its high efficiency in egineering medical information system "Population cancer register".

source: Программный код синтезируется на основе шаблонов, встроенных в правила и сценарии трансформации.
en_gb: The source code is synthesized from templates embedded in the rules and scenarios of transformation.

source: Простейшим способом является императивное описание процесса трансформации с использованием алгоритмического языка.
en_gb: The easiest way is an imperative description of the transformation process in an algorithmic language.

source: Процесс создания ИС начинается с построения вычислительно"=независимой модели~-- CIM (Computational Independent Model) или с построения платформенно"=независимой модели~-- PIM (Platform Independent Model) \cite{b115}.
en_gb: (!) According to MDA the process of creating the IS begins with the engineering a so called Computing independent model (CIM)) or Platform Independent Model (PIM) \cite{b115}.

source: Рассмотрим виды моделей информационных систем (ИС), их представление и трансформацию.
en_gb: Consider the model formalisms of information systems (IS), their representation and transformation.

source: Рассмотрим технологию автоматического синтеза (генерации) целевого программного кода ИС по ее модели.
en_gb: Consider the technology of the automatic synthesis (generation) of the target program code of the IS out of its model.

source: Реализованы подсистемы конвертации данных и генерации отчетных форм.
en_gb: The subsystems for data conversion and generation of annual report forms are created.

source: Результатом каждого OCL"=выражения является, как правило, логическое значение.
en_gb: Execution result of the OCL equation is a boolean value.

source: Результатом порождения программного кода каркаса \cite{b93} ИС являются:
en_gb: The results of the code generation of IS framework \cite{b93} are:

source: Рисунок.
en_gb: Figure.

source: С помощью языка описания трансформаций можно задать любую необходимую трансформацию для любой платформы.
en_gb: Using the description language of transformations one could specify any transformation to any target platform.

source: С учетом всех требований к программно"=аппаратной платформе на основе PSM синтезируется программный код ИС.
en_gb: PSM contains model details to completely generate source code of subsystems according to the structures and properties defined in it.

source: Синтез программного кода является процедурой преобразования UML"=модели, задающей требования к архитектуре ИС с учетом данных в базе знаний относительно среды реализации.
en_gb: Synthesis of program code is the process of converting UML model that specifies requirements for the architecture of the IS in accordance to the knowledge base content regarding the environment of the implementation.

source: Следующей стадией разработки является автоматическое порождение PSM и программного кода каркаса ИС.
en_gb: The next stage is the automatic generation of the PSM and code of IS framework.

source: Стадии создания каркаса ИС в соответствии с MDA.
en_gb: Scheme of IS framework development according to MDA

source: Существует несколько способов описания и выполнения трансформаций UML"=моделей.
en_gb: There are several ways to describe and perform transformations of UML model.

source: Схема применения данной технологии синтеза каркаса ИС представлена на рис.
en_gb: The scheme of application of this technology for the synthesis of the IS framework is shown in Fig.

source: Схема применения технологии разработки ИС.
en_gb: Scheme of the use of technology in the development of IS

source: Также желательно, чтобы язык допускал эффективное структурирование описания трансформации, т.
en_gb: It is also desirable that language would allow the efficient structuring of the description of the transformation i.

source: Такого рода ограничения играют важную роль в проектировании и реализации ИС.
en_gb: The constraints play an important role in the design and implementation of the IS,

source: Такого рода ограничения играют важную роль в проектировании и реализации ИС.~Ограничения задают свойства как предметной области разрабатываемой ИС, так и специфики ее реализации.
en_gb: The constraints play an important role in the design and implementation of the IS, they define the properties of the domain and its implementation perculiarities.

source: Универсальность правил трансформации.
en_gb: (SHT) The universality of the rules of transformation.

source: Уточнения CIM приводят к создания PIM.
en_gb: CIM refinements lead to specification og PIM.

source: Уточнения CIM приводят к создания PIM.~В рассматриваемом далее подходе к реализации MDA не используются CIMмодели.
en_gb: CIM refinements lead to specification og PIM. (?) We have no experience of usage CIM in IS specifications, but \ldots.

source: Формальность и полнота.
en_gb: (SHT) The ?formality? and completeness.

source: Элементы трансформации представлены логическими правилами (продукциями), формирующими базу знаний.
en_gb: The elements of the transformation are represented by logical rules (productions) forming a knowledge base.

source: Эти подсистемы позволяют загружать информацию из БД ранее используемых программ, создавать печатные формы первичных документов регистра, формировать ежегодные отчеты.
en_gb: (SKIP)

source: Это значит, что от пользователей такой системы требуется знание не только UML"=моделирования, но и теории графов и принципов их трансформации.
en_gb: That users of such a system will require to know UML modeling, graph theory, and principles of graph structures manipulation.

source: Это значит, что уже после трансформации как исходные модели, так и модели, созданные в процессе трансформации, могут быть изменены.
en_gb: After transformation, source models and models created in the process of transformation might be changed.

source: Это означает, что описание трансформации должно быть понятно не только создавшему его программисту, но и тому, кто планирует его использовать.
en_gb: The description of the transformation must be understood not only by the creator programmer, but also someone who is planning to use it.

source: Это позволяет отслеживать ограничения как родительского объекта, так и всех дочерних и объектов, связанных с родительским.
en_gb: (?) OCL allows one to track the class instances, and the instances of descendant classes.

source: Этот файл поступает на вход XMI"=транслятора, базирующегося на стандартной библиотеке 11Ьхт12 \cite{b151}, который преобразует данные XMI"=файла в объектную модель документа, удовлетворяющую требованиям структуры DOM"=2 [119].
en_gb: The input is processed by XML translator, based on the library libxml2 \cite{b151}, which converts XMI file in a Element tree object model [119, etree].

source: Этот формат предназначен, главным образом, для хранения UML"=данных, а также любых других данных, метамодель которых задана с помощью MOF (Meta Object Facility).
en_gb: XMI format is intended mainly for storing UML model and any other data whose metamodel specified using the MOF (Meta Object Facility).

source: Язык OCL позволяет выполнять три операции над объектами:
en_gb: OCL includes three operations:

source: Язык описания трансформации должен быть понятным для человека и иметь легко читаемую нотацию.
en_gb: The description language of the transformation should be human-readable and have easy-to-read notation.

source: вызов операции класса и получение значения, возврашаемого операцией.
en_gb: sending message to an instance and receiving the answer.

source: е.
en_gb: e.

source: его разбиение на слабо зависимые части.
en_gb: splitting on the weakly dependent parts.

source: заготовки (шаблоны) элементов пользовательского (визуального) интерфейса.
en_gb: stubs (templates) of graphics user interface widget layouts.

source: задания инвариантов~-- логических выражений, вычисление которых должно давать значение «true» в момент созданиякаждого экземпляра объекта и сохранять это значение в течение всего времени жизни этого объекта;
en_gb: invariant constraints, which must hold after object instance creation till its destruction;

source: задания преди постусловий, накладываемых на операции и методы.
en_gb: definition of pre- and postconditions of operations;

source: описания охранных условий, используются, как правило, в диаграммах состояния UML.
en_gb: (?) guarding conditions;

source: описания охранных условий, используются, как правило, в диаграммах состояния UML.~Они представляют собой условие, которое должно быть выполнено для возможности осуществления перехода между смежными состояниями.
en_gb: switching conditions in UML State diagram,

source: переход по соединению;
en_gb: association transition;

source: получение значения атрибута;
en_gb: atribute value evaluation;

source: со значительной детализацией особенностей реализации по сравнению с PIM.
en_gb: (Skip PSM is mostly detailed PIM)

source: со значительной детализацией особенностей реализации по сравнению с PIM.~С учетом всех требований к программно"=аппаратной платформе на основе PSM синтезируется программный код ИС.~Общая схема трансформации из PIM в PSM представлена на рис.
en_gb: PSM is to contain enough details to generate source code of subsystems according to the structures and properties defined in it.

source: трансформаций, созданные независимыми разработчиками.
en_gb: (SKIP)
